/**
* 显示人物数据面板的数据 
*/
module module{
	export class personText{
		constructor(){

		}

		public arr:Array<any> = [["我最喜欢简简单单的普通地台，什么车都能搭配~~","好渴，大型饮料机在哪儿？","听说VR试驾可以体验真车上路的爽快！"],["只要上了增高地台，不管什么车都变高富帅~","汽车门店里面居然有自助餐吧，脑洞大开！","我一直对汽车的制动结构很好奇…"],["赛道地台很带感，菜鸟秒变车神~","我很实在，我不是来买车的，我是来拿赠品的","游戏操作台超好玩，去晚了就没位置了！"],["走，去越野地台，尽情撒野！","先踩离合后挂档，手波变速特别忙","前台的AI小姐姐有男朋友了吗？"]];
		public oddsArr:Array<any> = [
			[
				["48%","1%","1%","1%","1%","5%","10%","1%","1%","1%","1%","1%","5%","10%","1%","1%","1%","5%","5%"],
				["40%","1%","1%","1%","1%","1%","20%","1%","1%","1%","1%","5%","3%","10%","1%","1%","1%","5%","5%"]
			],
			[
				["10%","30%","10%","1%","1%","1%","1%","20%","1%","1%","1%","1%","10%","7%","1%","1%","1%","1%","1%"],
				["1%","35%","1%","1%","1%","25%","1%","5%","5%","5%","5%","1%","1%","1%","1%","4%","5%","1%","1%"]
			],
			[
				["1%","1%","1%","21%","30%","20%","1%","1%","1%","1%","1%","1%","1%","1%","10%","5%","1%","1%","1%"],
				["1%","20%","35%","1%","1%","1%","18%","5%","1%","1%","1%","8%","1%","1%","1%","1%","1%","1%","1%"]
			],
			[
				["1%","1%","1%","21%","30%","20%","1%","1%","1%","1%","1%","1%","1%","1%","10%","5%","1%","1%","1%"],
				["1%","20%","35%","1%",	"1%","1%","18%","5%","1%","1%","1%","8%","1%","1%","1%","1%","1%","1%","1%"]
			]
		];

		private static _instance:personText;
		public static getInstance():personText
		{
			if(this._instance == null)
			{
				this._instance = new personText;
			}
			return this._instance;
		}
	}
}